In [1]:
import pandas as pd
import os
from datetime import datetime

# SET WORK DERC
os.chdir('//Users//patricklee//Desktop//파이썬//DACON//2020DACON_CUP')

In [2]:
train_df = pd.read_csv(r'./train.csv',encoding='cp949',)
login_df = pd.read_csv(r'./info_login.csv')
user_df = pd.read_csv(r'./info_user.csv')
compe_df = pd.read_csv(r'./info_competition.csv',encoding='cp949')

/Users/patricklee/opt/anaconda3/lib/python3.7/site-packages/IPython/core/interactiveshell.py:3063: DtypeWarning: Columns (4,5) have mixed types.Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)

In [3]:
all_data = [train_df,login_df,user_df,compe_df]
just_data = [login_df,user_df,compe_df]
user_data = [user_df,login_df]

In [4]:
for i in all_data :
    print('-'*50)
    i.info()

--------------------------------------------------
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 19008 entries, 0 to 19007
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   DateTime  19008 non-null  object
 1   사용자       19008 non-null  int64
 2   세션        19008 non-null  int64
 3   신규방문자     19008 non-null  int64
 4   페이지뷰      19008 non-null  int64
dtypes: int64(4), object(1)
memory usage: 742.6+ KB
--------------------------------------------------
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 151428 entries, 0 to 151427
Data columns (total 6 columns):
 #   Column      Non-Null Count   Dtype
---  ------      --------------   -----
 0   Unnamed: 0  148999 non-null  float64
 1   login_id    148999 non-null  float64
 2   user_id     141585 non-null  float64
 3   c_time      148999 non-null  object
 4   platform    64654 non-null   object
 5   browser     64654 non-null   object
dtypes: float64(3), object(3)
memory usage: 6.9+ MB
--------------------------------------------------
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 22103 entries, 0 to 22102
Data columns (total 9 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   Unnamed: 0               21692 non-null  float64
 1   id                       21692 non-null  float64
 2   c_time                   21692 non-null  object
 3   entered_competition_cnt  21692 non-null  float64
 4   code_share_cnt           21692 non-null  float64
 5   talk_board_cnt           21692 non-null  float64
 6   country_code             21692 non-null  float64
 7   python_level             21692 non-null  float64
 8   ds_level                 21692 non-null  float64
dtypes: float64(8), object(1)
memory usage: 1.5+ MB
--------------------------------------------------
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 48 entries, 0 to 47
Data columns (total 16 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Unnamed: 0        48 non-null     int64
 1   cpt_id            48 non-null     int64
 2   is_official       48 non-null     int64
 3   period_start      48 non-null     object
 4   period_end        48 non-null     object
 5   name              48 non-null     object
 6   name_eng          25 non-null     object
 7   keyword           48 non-null     object
 8   keyword_eng       24 non-null     object
 9   participants      48 non-null     int64
 10  max_team_member   48 non-null     int64
 11  max_file_per_day  48 non-null     int64
 12  prize             48 non-null     int64
 13  prize_info        32 non-null     object
 14  merge_deadline    48 non-null     object
 15  winner_show       48 non-null     int64
dtypes: int64(8), object(8)
memory usage: 6.1+ KB

In [5]:
for i in all_data:
    print('-'*50)
    print(i.isnull().sum())

--------------------------------------------------
DateTime    0
사용자         0
세션          0
신규방문자       0
페이지뷰        0
dtype: int64
--------------------------------------------------
Unnamed: 0     2429
login_id       2429
user_id        9843
c_time         2429
platform      86774
browser       86774
dtype: int64
--------------------------------------------------
Unnamed: 0                 411
id                         411
c_time                     411
entered_competition_cnt    411
code_share_cnt             411
talk_board_cnt             411
country_code               411
python_level               411
ds_level                   411
dtype: int64
--------------------------------------------------
Unnamed: 0           0
cpt_id               0
is_official          0
period_start         0
period_end           0
name                 0
name_eng            23
keyword              0
keyword_eng         24
participants         0
max_team_member      0
max_file_per_day     0
prize                0
prize_info          16
merge_deadline       0
winner_show          0
dtype: int64

# TAKE A LOOK DATA

In [6]:
login_df.describe(include ="O")

                  c_time platform               browser
count             148999    64654                 64654
unique            126992       10                   277
top     2020-06-20 14:22  Windows  Chrome 78.0.3904.108
freq                  19    43287                  9026

In [7]:
login_df.describe()

          Unnamed: 0       login_id        user_id
count  148999.000000  148999.000000  141585.000000
mean    74499.000000  382742.827549   11266.851192
std     43012.450717  192416.422939    6260.379459
min         0.000000   14196.000000       0.000000
25%     37249.500000  206014.500000    5947.000000
50%     74499.000000  509882.000000   11328.000000
75%    111748.500000  547143.500000   16509.000000
max    148998.000000  584408.000000   22102.000000

In [8]:
obj_col = [x for x in login_df.columns if login_df[x].dtypes == "O"]
num_col = [x for x in login_df.columns if login_df[x].dtypes in ['int64','float64']]

In [9]:
login_df.head()

,Unnamed: 0,login_id,user_id,c_time,platform,browser
0,0.0,14196.0,19195.0,2018-09-23 1:30,Windows 8,Internet Explorer 10.0
1,1.0,14234.0,22045.0,2018-09-23 2:46,Windows,Chrome 67.0.3396.99
2,2.0,14256.0,8790.0,2018-09-23 3:35,Windows,Chrome 69.0.3497.100
3,3.0,14278.0,NaN,2018-09-23 12:50,Windows,Chrome 69.0.3497.100
4,4.0,14279.0,NaN,2018-09-23 12:50,Windows,Chrome 69.0.3497.100

In [10]:
user_df.head()

,Unnamed: 0,id,c_time,entered_competition_cnt,code_share_cnt,talk_board_cnt,country_code,python_level,ds_level
0,0.0,15994.0,2017-05-02 23:58,94.0,306.0,477.0,82.0,1.0,1.0
1,1.0,19195.0,2018-08-08 18:21,1.0,0.0,0.0,82.0,1.0,1.0
2,2.0,16339.0,2018-08-08 19:57,1.0,0.0,0.0,82.0,1.0,1.0
3,3.0,7290.0,2018-08-08 19:59,0.0,0.0,0.0,82.0,1.0,1.0
4,4.0,21287.0,2018-08-08 20:26,0.0,0.0,0.0,82.0,1.0,1.0

In [11]:
user_df.describe()

,Unnamed: 0,id,entered_competition_cnt,code_share_cnt,talk_board_cnt,country_code,python_level,ds_level
count,21692.000000,21692.000000,21692.000000,21692.000000,21692.000000,21692.000000,21692.000000,21692.000000
mean,10845.500000,11055.887055,1.715748,0.066661,0.095796,81.928729,0.994652,0.993454
std,6262.085356,6384.651761,2.912532,2.513415,3.916602,20.724577,0.082986,0.087236
min,0.000000,0.000000,0.000000,0.000000,0.000000,1.000000,0.000000,0.000000
25%,5422.750000,5526.750000,0.000000,0.000000,0.000000,82.000000,1.000000,1.000000
50%,10845.500000,11045.500000,1.000000,0.000000,0.000000,82.000000,1.000000,1.000000
75%,16268.250000,16593.250000,2.000000,0.000000,0.000000,82.000000,1.000000,1.000000
max,21691.000000,22102.000000,94.000000,306.000000,477.000000,998.000000,2.000000,2.000000

In [12]:
compe_df.head()

,Unnamed: 0,cpt_id,is_official,period_start,period_end,name,name_eng,keyword,keyword_eng,participants,max_team_member,max_file_per_day,prize,prize_info,merge_deadline,winner_show
0,0,136,1,2018-08-14 0:00,2018-09-13 23:59,대출 상점 총 매출 예측 경진대회,Shop Total Sales Forecast,"금융 | 소상공인 신용카드 가맹점 빅데이터와 AI로 매출 예측 | 시계열, 회귀 ...",[Finance] Small Business Credit Card Merchant ...,303,5,5,850,"$8,500 + 100,000ZPR",2018-09-13 23:59,3
1,1,9565,1,2018-09-15 0:00,2018-10-13 23:59,병원 개/폐업 분류 예측 경진대회,hospital opening / closing classification pred...,금융 | 병원 재무 데이터와 AI로 개업|폐업 예측 분석 | 분류 | Accuracy,[Financial] Hospital financial data and openin...,448,10,3,350,"$3,500 + 40,000ZPR",2018-10-13 23:59,3
2,2,17801,1,2018-10-18 0:00,2018-12-31 23:59,아파트 경매가격 예측 경진대회,Apartment Auction Price Forecast,금융 | 부동산 아파트 경매 빅데이터와 AI로 경매가 예측 분석 | 회귀 | RMSE,[Finance] Real Estate Apartment Auction Big Da...,316,10,3,1000,"$10,000 + 120,000ZPR",2018-12-31 23:59,3
3,3,21265,1,2018-11-13 0:00,2019-01-31 23:59,아파트 실거래가 예측,apartment real price forecast,금융 | 부동산 빅데이터와 AI를 이용하여 실거래가를 예측 분석 | 회귀 | RMSE,[Finance] Predictive analysis of real transact...,568,10,3,800,"$8,000 + 80,000ZPR",2019-01-31 23:59,3
4,4,42473,1,2018-12-25 0:00,2019-01-10 23:59,신용카드 거래 데이터 시각화,credit card transaction data visualization,"금융 | 신용카드, 시계열, 시각화 | Python, R, Tableau, Spot...","[Finance] Credit cards, time series, visualiza...",252,5,3,100,"$1,000 + 100,000ZPR",2019-01-10 23:59,3

In [13]:
compe_df.describe()

,Unnamed: 0,cpt_id,is_official,participants,max_team_member,max_file_per_day,prize,winner_show
count,48.000000,48.000000,48.0,48.00000,48.000000,48.000000,48.000000,48.000000
mean,55.979167,199643.916667,1.0,635.62500,4.958333,7.479167,769.791667,3.979167
std,36.101800,75395.337756,0.0,417.59232,1.978161,14.098422,859.546044,2.522154
min,0.000000,136.000000,1.0,70.00000,1.000000,3.000000,0.000000,0.000000
25%,17.750000,233953.500000,1.0,338.00000,4.000000,3.000000,200.000000,3.000000
50%,66.500000,235607.000000,1.0,484.50000,5.000000,3.000000,600.000000,3.000000
75%,86.250000,235646.250000,1.0,897.50000,5.000000,10.000000,1000.000000,3.000000
max,109.000000,235682.000000,1.0,1983.00000,10.000000,100.000000,4850.000000,11.000000

In [14]:
login_df=login_df.drop('Unnamed: 0', axis=1)
user_df=user_df.drop('Unnamed: 0', axis=1)
compe_df=compe_df.drop('Unnamed: 0', axis=1)

In [15]:
login_df.head()

   login_id  user_id            c_time   platform                 browser
0   14196.0  19195.0   2018-09-23 1:30  Windows 8  Internet Explorer 10.0
1   14234.0  22045.0   2018-09-23 2:46    Windows     Chrome 67.0.3396.99
2   14256.0   8790.0   2018-09-23 3:35    Windows    Chrome 69.0.3497.100
3   14278.0      NaN  2018-09-23 12:50    Windows    Chrome 69.0.3497.100
4   14279.0      NaN  2018-09-23 12:50    Windows    Chrome 69.0.3497.100

In [16]:
user_df.head()

,id,c_time,entered_competition_cnt,code_share_cnt,talk_board_cnt,country_code,python_level,ds_level
0,15994.0,2017-05-02 23:58,94.0,306.0,477.0,82.0,1.0,1.0
1,19195.0,2018-08-08 18:21,1.0,0.0,0.0,82.0,1.0,1.0
2,16339.0,2018-08-08 19:57,1.0,0.0,0.0,82.0,1.0,1.0
3,7290.0,2018-08-08 19:59,0.0,0.0,0.0,82.0,1.0,1.0
4,21287.0,2018-08-08 20:26,0.0,0.0,0.0,82.0,1.0,1.0

In [17]:
user_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 22103 entries, 0 to 22102
Data columns (total 8 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   id                       21692 non-null  float64
 1   c_time                   21692 non-null  object
 2   entered_competition_cnt  21692 non-null  float64
 3   code_share_cnt           21692 non-null  float64
 4   talk_board_cnt           21692 non-null  float64
 5   country_code             21692 non-null  float64
 6   python_level             21692 non-null  float64
 7   ds_level                 21692 non-null  float64
dtypes: float64(7), object(1)
memory usage: 1.3+ MB

In [18]:
login_df.sort_values(by='c_time',axis=0)
login_df

        login_id  user_id            c_time   platform                 browser
0        14196.0  19195.0   2018-09-23 1:30  Windows 8  Internet Explorer 10.0
1        14234.0  22045.0   2018-09-23 2:46    Windows     Chrome 67.0.3396.99
2        14256.0   8790.0   2018-09-23 3:35    Windows    Chrome 69.0.3497.100
3        14278.0      NaN  2018-09-23 12:50    Windows    Chrome 69.0.3497.100
4        14279.0      NaN  2018-09-23 12:50    Windows    Chrome 69.0.3497.100
...          ...      ...               ...        ...                     ...
151423       NaN      NaN               NaN        NaN                     NaN
151424       NaN      NaN               NaN        NaN                     NaN
151425       NaN      NaN               NaN        NaN                     NaN
151426       NaN      NaN               NaN        NaN                     NaN
151427       NaN      NaN               NaN        NaN                     NaN

[151428 rows x 5 columns]

# trans time value

In [20]:
user_df['c_time']=pd.to_datetime(user_df['c_time'])
user_df['c_time'] = user_df['c_time'].dt.date

In [ ]:
# user_df['c_time']=pd.to_datetime(user_df['c_time'])
# login_df['c_time']=pd.to_datetime(login_df['c_time'],format='%Y-%m-%d')

In [21]:
user_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 22103 entries, 0 to 22102
Data columns (total 8 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   id                       21692 non-null  float64
 1   c_time                   21692 non-null  object
 2   entered_competition_cnt  21692 non-null  float64
 3   code_share_cnt           21692 non-null  float64
 4   talk_board_cnt           21692 non-null  float64
 5   country_code             21692 non-null  float64
 6   python_level             21692 non-null  float64
 7   ds_level                 21692 non-null  float64
dtypes: float64(7), object(1)
memory usage: 1.3+ MB

In [22]:
login_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 151428 entries, 0 to 151427
Data columns (total 5 columns):
 #   Column    Non-Null Count   Dtype
---  ------    --------------   -----
 0   login_id  148999 non-null  float64
 1   user_id   141585 non-null  float64
 2   c_time    148999 non-null  object
 3   platform  64654 non-null   object
 4   browser   64654 non-null   object
dtypes: float64(2), object(3)
memory usage: 5.8+ MB

In [23]:
user_df.head()

,id,c_time,entered_competition_cnt,code_share_cnt,talk_board_cnt,country_code,python_level,ds_level
0,15994.0,2017-05-02,94.0,306.0,477.0,82.0,1.0,1.0
1,19195.0,2018-08-08,1.0,0.0,0.0,82.0,1.0,1.0
2,16339.0,2018-08-08,1.0,0.0,0.0,82.0,1.0,1.0
3,7290.0,2018-08-08,0.0,0.0,0.0,82.0,1.0,1.0
4,21287.0,2018-08-08,0.0,0.0,0.0,82.0,1.0,1.0

# Nothing

In [24]:
user_df.sort_values(by='c_time',axis=0)
user_df

,id,c_time,entered_competition_cnt,code_share_cnt,talk_board_cnt,country_code,python_level,ds_level
0,15994.0,2017-05-02,94.0,306.0,477.0,82.0,1.0,1.0
1,19195.0,2018-08-08,1.0,0.0,0.0,82.0,1.0,1.0
2,16339.0,2018-08-08,1.0,0.0,0.0,82.0,1.0,1.0
3,7290.0,2018-08-08,0.0,0.0,0.0,82.0,1.0,1.0
4,21287.0,2018-08-08,0.0,0.0,0.0,82.0,1.0,1.0
...,...,...,...,...,...,...,...,...
22098,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
22099,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
22100,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
22101,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
22102,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [25]:
user_df.isnull().sum()

id                         411
c_time                     411
entered_competition_cnt    411
code_share_cnt             411
talk_board_cnt             411
country_code               411
python_level               411
ds_level                   411
dtype: int64

In [26]:
user_df.shape

(22103, 8)

In [27]:
user_df = user_df.dropna(axis=0, how='any')

In [28]:
user_df.shape

(21692, 8)

In [29]:
22103 - 21692

411

In [ ]:
# user_df.rename(columns={'id':'user_id'},inplace=True)
# user_df.head()

In [ ]:
# merge_df = pd.merge(user_df, login_df,how='outer',on='user_id')
# merge_df.head()

In [ ]:
# merge_df.shape

In [ ]:
# merge_df.isnull().sum()

In [ ]:
login_df.rename(columns={'login_id':'id'})

In [ ]:
merge_df = pd.merge(login_df, user_df,how='right',on='id')
merge_df.head()